/*************************************************************************
	> File Name: max_in_line.cpp
	> Author: jiexue
	> Mail: jiexuelc@163.com
	> Created Time: Mon 08 Oct 2018 08:42:49 PM CST
	> Description: 求A\B玩家在一排正数中拿到的最大值
                   条件：1.一排正数，玩家A和玩家B都可以看到;
                        2.每位玩家在拿走数字的时候，都只能从最左和最右的数中选择一个;
                        3.玩家A先拿，玩家B再拿，两人交替拿走所有的数字;
                        4.两人都力争自己拿到的数的总和比对方多。
 ************************************************************************/

#include <iostream>
using namespace std;


int behand()
{
    
}
